Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of SuperTuxKart and creates a package.
Identifier: improbable.pkg.SuperTuxKart
ParentRecipe: improbable.download.SuperTuxKart
MinimumVersion: 1.0.0

Input:
  NAME: SuperTuxKart

Process:
- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
    purge_destination: true

- Processor: AppPkgCreator
  Arguments:
    app_path: '%RECIPE_CACHE_DIR%/%NAME%/SuperTuxKart.app'
