Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of SuperTuxKart and imports it into Munki.
Identifier: improbable.munki.SuperTuxKart
ParentRecipe: improbable.download.SuperTuxKart
MinimumVersion: 1.0.0

Input:
  NAME: SuperTuxKart
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: The code base of supertuxkart
    developer: SuperTuxKart
    display_name: SuperTuxKart
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
    purge_destination: true

- Processor: DmgCreator
  Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/%NAME%.dmg'
    dmg_root: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%dmg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
