Description: Download recipe for Puppet.
Identifier:  improbable.download.puppet
MinimumVersion: 0.5.0

Input:
  NAME: Puppet7
  OS_VERSION: '11'
  ARCH: 'x86_64' # 'x86_64' or 'arm64'
  URL: https://downloads.puppetlabs.com/mac/puppet7

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: '%URL%/%OS_VERSION%/%ARCH/puppet-agent-latest.dmg'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: PUPPET LABS, INC. (VKGLGN2B6Y)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%/*.pkg'
