Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Anka and imports it into Munki.
Identifier: improbable.munki.Anka
ParentRecipe: improbable.download.Anka
MinimumVersion: 1.0.0

Input:
  NAME: Anka
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    blocking_applications:
    - Anka.app
    - ankahv.app
    catalogs:
    - testing
    description: Execute macOS and iOS CI/CD in sandboxed VMs on your developer laptops.
    developer: Veertu Inc
    display_name: Anka
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
