Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Boop and creates a package.
Identifier: improbable.pkg.Boop
ParentRecipe: improbable.download.Boop
MinimumVersion: 1.0.0

Input:
  NAME: Boop

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%RECIPE_CACHE_DIR%/%NAME%/Boop.app'
