Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Rainway.
Identifier: improbable.download.Rainway
MinimumVersion: 1.0.0

Input:
  NAME: Rainway

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: https://releases.rainway.com/macos/Rainway.dmg

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Rainway.app'
    requirement: anchor apple generic and identifier "com.rainway.ios.client" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "78995B7FMV")

- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/Rainway.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
