Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Rainway and imports it into Munki.
Identifier: improbable.munki.Rainway
ParentRecipe: improbable.download.Rainway
MinimumVersion: 1.0.0

Input:
  NAME: Rainway
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: OpenTrack is a well-established railway planning software and it is used by railways, the railway supply industry, consultancies and universities in different countries.
    developer: Rainway
    display_name: Rainway
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
