Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Silicon Info and imports it into Munki.
Identifier: improbable.munki.SiliconInfo
ParentRecipe: improbable.download.SiliconInfo
MinimumVersion: 1.0.0

Input:
  NAME: Silicon Info
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: Mac menu bar tool to view the architecture of the running application
    developer: billycastelli@gmail.com
    display_name: Silicon Info
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: DmgCreator
  Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/%NAME%.dmg'
    dmg_root: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%dmg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
