Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Silicon Info and creates a package.
Identifier: improbable.pkg.SiliconInfo
ParentRecipe: improbable.download.SiliconInfo
MinimumVersion: 1.0.0

Input:
  NAME: Silicon Info

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%RECIPE_CACHE_DIR%/%NAME%/Silicon Info.app'
