Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Silicon Info.
Identifier: improbable.download.SiliconInfo
MinimumVersion: 1.0.0

Input:
  NAME: Silicon Info

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    github_repo: billycastelli/Silicon-Info

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%.zip'

- Processor: EndOfCheckPhase

- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
    purge_destination: true

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/%NAME%/Silicon Info.app'
    requirement: 'identifier "com.wcastelli.silicon-info" and anchor apple generic and certificate leaf[subject.CN] = "Apple Development: billycastelli@gmail.com (24BND862YS)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */'

- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/%NAME%/Silicon Info.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
