Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Automates deployment of containerized applications.
Identifier: improbable.munki.BraveUniversal
ParentRecipe: com.github.moofit-recipes.pkg.BraveUniversal
MinimumVersion: 1.0.0

Input:
  NAME: Brave
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: Automates deployment of containerized applications.
    developer: Brave
    display_name: Brave
    name: '%NAME%'
    unattended_install: true

Process:

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%Universal-%version%.pkg'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
