Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Automates deployment of containerized applications.
Identifier: improbable.munki.DockerUniversal
ParentRecipe: com.github.moofit-recipes.pkg.DockerUniversal
MinimumVersion: 1.0.0

Input:
  NAME: Docker
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: Automates deployment of containerized applications.
    developer: Docker
    display_name: Docker
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: DmgCreator
  Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/%NAME%Universal-%version%.dmg'
    dmg_root: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%dmg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
