Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Cloudflare WARP and imports it into Munki.
Identifier: improbable.munki.CloudflareWARP
ParentRecipe: improbable.download.CloudflareWARP
MinimumVersion: 1.0.0

Input:
  NAME: Cloudflare WARP
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    blocking_applications:
    - LoginLauncherApp.app
    - Cloudflare WARP.app
    - Updater.app
    catalogs:
    - testing
    description: 1.1.1.1 from CloudFlare is the fast and private way to browse the Internet. It is a public DNS resolver, but unlike most DNS resolvers, 1.1.1.1 is not selling user data to advertisers. The implementation of 1.1.1.
    developer: Cloudflare
    display_name: Cloudflare WARP
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: DmgCreator
  Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/%NAME%.dmg'
    dmg_root: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      version: '%version%'

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%dmg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
    version_comparison_key: CFBundleVersion
