Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Cloudflare WARP.
Identifier: improbable.download.CloudflareWARP
MinimumVersion: 1.0.0

Input:
  NAME: Cloudflare WARP

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '"id":(\d+),'
    result_output_var_name: release_id
    url: https://install.appcenter.ms/api/v0.1/apps/cloudflare/1.1.1.1-macos-1/distribution_groups/release/public_releases

- Processor: URLTextSearcher
  Arguments:
    re_pattern: '"download_url":"(https:\/\/.+\.app\.zip\?.+)","install_url":'
    result_output_var_name: url
    url: https://install.appcenter.ms/api/v0.1/apps/cloudflare/1.1.1.1-macos-1/distribution_groups/release/releases/%release_id%

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.zip'

- Processor: EndOfCheckPhase

- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
    purge_destination: true

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Cloudflare Inc. (68WVV388M8)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%RECIPE_CACHE_DIR%/%NAME%/Cloudflare_WARP.pkg'

- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    flat_pkg_path: '%RECIPE_CACHE_DIR%/%NAME%/Cloudflare_WARP.pkg'
    purge_destination: true

- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/payload'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/Cloudflare_WARP.pkg/Payload'
    purge_destination: true

- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/payload/Cloudflare WARP.app/Contents/Info.plist'
    plist_version_key: CFBundleVersion
